<script lang="ts" setup>
/**
 * 新旧站点切换提示，包括路径格式与网站部署平台
 */
import { onMounted, ref } from 'vue'

let isConfirm = ref(false)
let isHash = ref(false)
let hash = ref(''), title = ref(''), group = ref('')

const confirm = () => {
  isConfirm.value = true
}
/*
const i = k =>
  Object.keys(k).reduce((acc, key) => {
    acc[k[key]] = key;
    return acc;
  }, {});
str.slice(0,str.match(/521106d2_db461166_0/).index).match(/(.gif\))(.*?)(")/)[2]
*/

const str = `
"调试游戏及故障解决": "repair",
//"["icon_minus.gif)思想"
"地图制作入门引导（已更新）": "rm",
"mapper核心思维引导": "5b1507b4_b4750fca_0",
"基本要求与其他忠告": "4b270697_4f581582_0",
"红警2新人地图制作者需要有的几项觉悟": "xxcyjw",
"一些任务思想": "4b2f069b_7d470cdf_0",
"【竹蜻蜓】战略任务设计四原则": "4yz",
"关于PVP地图的创作给Modder们的一点小建议": "idckpvp",
"十类最差任务（已恢复）": "4b290698_7ba10cfd_0",
//"["icon_minus.gif)工具": "3e2c063a_37fe0885_0",
"FA2地图编辑器联盟版-瑞雪": "4b2f0699_7d4c164f_0",
"FA2sp-增强版地编": "fa2sp",
"任务封面制作器改良版（已更新）": "4b31069a_531d157a_0",
"个性化任务封面制作器": "4b37069d_503b1589_0",
"红警语言编辑器": "4b35069c_acda0f69_0",
"地图渲染器_20211214": "4b33069b_59cb0afe_0",
"XCC-mix文件相关": "4b39069e_5de00b09_0",
"红警2Modder工具箱（已更新）": "ra2mt",
"其他工具（已更新）": "5a290770_1129134d_0",
//"["icon_minus.gif)基础与综合教程",
"ChaleB专栏文集:地图编辑器入门基础教程": "clb1",
"ChaleB视频集:地编触发与事件基础教程": "clb3",
"地图编辑器介绍（简明版）": "521406d4_e8b219df_0",
"地图开荒手册": "4b33069a_7bf50c89_0",
"如何画好一个悬崖": "521106d2_db461166_0",
"红警任务简明制作教程（菜鸟入门篇）": "5abd0791_c37024a6_0",
"红警任务简明制作教程（新手进阶篇）": "5ac30782_c3e824bb_0",
"一个非常完整的任务教程": "4b3d069f_9aca17c7_0",
"Zero Fanker的地图制作分享（等待恢复）": "zfmap",
"其他地编视频教程收集（已更新）": "spjc",
"竹蜻蜓（Heli）系列教程收集": "heli_tutorial",
"任务制作核心内容第九期": "4b4106a1_9c411806_0",
"单位面板中的一些内容（待修改）": "5a630773_4faf157f_0",
"多关任务的命名规则": "520c06d0_fda12fe_0",
"地图出错了怎么办": "520506cd_d94010f6_0",
//"["icon_minus.gif)美化进阶",
"在两个小时内做一张好看的红警地图": "how2h",
"复制、粘贴地形的几种运用（已更新）": "copy.md",
"悬崖手拼视频教程": "5acb077f_7a430ca3_0",
"树木外形对照": "tree",
"红警地图美化细化基础教程": "521606d5_e7b819cb_0",
"城市地图详细制作教程": "520d06d0_de7619b9_0",
"某斯内克的城市图经验谈": "520706cd_8707170a_0",
"关于进阶地表美化": "520706ce_dc5c115f_0",
"风景地图欣赏": "520f06d1_7d460d19_0",
"使用TX地形": "useTX",
"灯光建筑的使用": "520906ce_a5b10f12_0",
"灯光建筑INI编写": "5b0b07aa_9b5e0da7_0",
"海底地图效果": "520b06d0_80390d19_0",
"昼夜循环": "520906cf_3a6108d1_0",
"自定义遭遇战地图的预览图": "5ac1077d_d6bf1953_0",
"战役中所属方颜色 图解说明": "520b06cf_f7fd1a34_0",
"常用的音效及语音（已更新）": "4b4506a3_da101139_0",
"添加背景音乐": "59e80739_7cd70cf5_0",
"改变任务文本信息的颜色（已更新）": "5a5d076e_94851784_0",
//"["icon_minus.gif)触发与小队进阶",
"触发教程1：菜鸟初学者必看！": "4b35069b_3acd1bc4_0",
"触发教程2：局部变量": "4b37069c_19451315_0",
"触发教程3：手动改图": "4b39069d_19191363_0",
"(重要)特遣脚本小队AI触发全教程": "zzxd",
"小队：让地图上现有的单位执行脚本": "520606cd_527e2227_0",
"小队：使一个特遣部队被摧毁后触发事件": "521606d4_369d26da_0",
"小队：怎样做一个“轮渡”？": "5a570771_30041bf6_0",
"小队：运输船卸载后返回且成员执行命令": "520806ce_b488291f_0",
"循环援军触发": "59d30732_7db20cdb_0",
"移动到路径点脚本导致小队卡住": "7ae9089f_91241e43_0",
"关于脚本中“面向”动作的参数": "521306d3_80321d6c_0",
"触发：如何关联无限个触发到一个单位上": "521806d5_250b2666_0",
"触发：关于设置科技等级的触发组应用": "521206d2_c18b249e_0",
"触发：用触发或者局部变量，实现判定逻辑": "521906d6_8f942829_0",
"触发：炸桥触发事件": "520c06cf_125a1385_0",
"触发：计时器转计数器与正数计时器": "521006d1_5e2e2304_0",
"触发条件 30 电力不足 bug说明": "59d00741_d45717b2_0",
"触发行为 41 播放动画在... 参数说明（已更新）": "520e06d1_c3261d40_0",
"触发行为 42 爆炸在... 参数说明（已更新）": "520106cb_d68e1a44_0",
"触发行为 88 粒子动画... 参数说明": "5af507a1_66511b12_0",
"触发行为 135 超武首选目标路径点...说明": "521506d4_8709261e_0",
"触发行为 10＆100 播放影片... 参数说明": "5b2707b3_f9bb1dd2_0",
"触发条件 51 随机延时... 参数说明": "520a06ce_6bac1b53_0",
"触发类型 1 参数说明": "521406d3_f8421185_0",
"AI触发：马王神新AI教程": "maw",
"AI触发：TS平台AI(MD).ini教程（LH_Mouse原始版，Zero Fanker修订版）": "TS平台AI(MD).ini教程（LH_Mouse原始版，Zero Fanker修订版）",
"AI触发：TS平台AI(MD).ini教程（旧版）": "7d9f0912_95710c25_0",
"AI触发：地图AI教程": "734e083f_469b0928_0",
//"["icon_minus.gif)其他教程",
"给任务添加评分板评语": "591e0706_560d15bc_0",
"【竹蜻蜓】基地节点指南1.1": "基地节点指南",
"【竹蜻蜓】局部变量教程1.0": "局部变量教程1.0",
"(重要)如何用记事本看地图文件(地图内部数据解析)": "auygydt",
"红警任务变量论": "5b0207a7_ab9c0f44_0",
"FA2工具脚本相关(待修改)": "521106d3_4be814a4_0",
"【竹蜻蜓】平台差异:载具离开地图时内容物的摧毁判定": "5a4c077d_d0212db7_0",
"基地中心单元设置的初步尝试": "5a580772_jdzxdy_0",
"零碎内容、未添加教程（待修改）": "5ae30787_d7ca1103_0",
//"["icon_minus.gif)任务细节等（部分内容有误，待修改） ",
"任务制作细节1": "719507fb_8bc80d18_0",
"任务制作细节2": "719b07fe_8bc90d19_0",
"任务制作细节3": "719207f9_8bca0d1a_0",
"地图制作细节": "719f07ff_7e6a0cec_0",
"NOG给资深maper的话": "719307fa_a0e20ddd_0",
"Tips": "7af60893_3e201a1_0",
"常见错误揭示及补救方法": "7ae00876_98fa17c4_0",
"单人任务制作十大BUG": "7b7c08ad_11a8122b_0",
"无限关卡数目": "4b3b069e_798d0cbb_0",
"制作多人联机任务必须注意的": "5a28074b_3bd71c2c_0",
"多人合作任务教程": "4b3f06a0_dc66114e_0",
"关于地图内部数据解析": "5b3b07b7_4dc6154f_0",
"详细的隧道教程": "521006d2_a65c0ec0_0",
//"["icon_minus.gif)自定义游戏资源",
"心灵终结 自制战役注册（已更新）": "morw",
"ChaleB专栏文集:红色警戒2美工设计入门指引": "clb2",
"修改地形，地形对象，覆盖图等（已更新）": "4b3b069c_e3801144_0",
"MK2019年版教程附最新版代码词典": "mk",
"将代码内置进地图、部分代码示例": "7c8a08d6_7b880ca0_0",
"ini宝典，内含代码与教程": "7cf608d9_8f41172d_0",
"改磁电弹头实现永久瘫痪等效果": "7d7f0915_965c1e5e_0",
"原版废弃素材及使用办法": "7d55090a_8fe91777_0",
"使用新素材": "7d2908e7_5ab40afe_0",
"其他工具与教程（已更新）": "72e9087c_7db60cff_0",
//"["icon_minus.gif)拓展内容",
"了解游戏，游戏入门，快捷键大全": "59ea0748_59ba0ae7_0",
"相关组织、网站": "zz",
"官方地图与任务": "521206d0_ab190f64_0",
"Ra2和YR单位属性大全": "5ab60780_ca97104c_0",
"地图加密办法": "5aea079b_7c610cd4_0",
"联机对战等": "7d5208eb_86210d61_0",
"RA3相关": "5a360773_459c09a6_0",
}`
const list = {
  "repair": "调试游戏及故障解决",
  "rm": "地图制作入门引导（已更新）",
  "5b1507b4_b4750fca_0": "mapper核心思维引导",
  "4b270697_4f581582_0": "基本要求与其他忠告",
  "xxcyjw": "红警2新人地图制作者需要有的几项觉悟",
  "4b2f069b_7d470cdf_0": "一些任务思想",
  "4yz": "【竹蜻蜓】战略任务设计四原则",
  "idckpvp": "关于PVP地图的创作给Modder们的一点小建议",
  "4b290698_7ba10cfd_0": "十类最差任务（已恢复）",
  "3e2c063a_37fe0885_0": "装备仓库",
  "4b2f0699_7d4c164f_0": "FA2地图编辑器联盟版-瑞雪",
  "fa2sp": "FA2sp-增强版地编",
  "4b31069a_531d157a_0": "任务封面制作器改良版（已更新）",
  "4b37069d_503b1589_0": "个性化任务封面制作器",
  "4b35069c_acda0f69_0": "红警语言编辑器",
  "4b33069b_59cb0afe_0": "地图渲染器_20211214",
  "4b39069e_5de00b09_0": "XCC-mix文件相关",
  "ra2mt": "红警2Modder工具箱（已更新）",
  "5a290770_1129134d_0": "其他工具（已更新）",
  "clb1": "ChaleB专栏文集:地图编辑器入门基础教程",
  "clb3": "ChaleB视频集:地编触发与事件基础教程",
  "521406d4_e8b219df_0": "地图编辑器介绍（简明版）",
  "4b33069a_7bf50c89_0": "地图开荒手册",
  "521106d2_db461166_0": "如何画好一个悬崖",
  "5abd0791_c37024a6_0": "红警任务简明制作教程（菜鸟入门篇）",
  "5ac30782_c3e824bb_0": "红警任务简明制作教程（新手进阶篇）",
  "4b3d069f_9aca17c7_0": "一个非常完整的任务教程",
  "zfmap": "Zero Fanker的地图制作分享（等待恢复）",
  "spjc": "其他地编视频教程收集（已更新）",
  "heli_tutorial": "竹蜻蜓（Heli）系列教程收集",
  "4b4106a1_9c411806_0": "任务制作核心内容第九期",
  "5a630773_4faf157f_0": "单位面板中的一些内容（待修改）",
  "520c06d0_fda12fe_0": "多关任务的命名规则",
  "520506cd_d94010f6_0": "地图出错了怎么办",
  "how2h": "在两个小时内做一张好看的红警地图",
  "copy.md": "复制、粘贴地形的几种运用（已更新）",
  "5acb077f_7a430ca3_0": "悬崖手拼视频教程",
  "tree": "树木外形对照",
  "521606d5_e7b819cb_0": "红警地图美化细化基础教程",
  "520d06d0_de7619b9_0": "城市地图详细制作教程",
  "520706cd_8707170a_0": "某斯内克的城市图经验谈",
  "520706ce_dc5c115f_0": "关于进阶地表美化",
  "520f06d1_7d460d19_0": "风景地图欣赏",
  "useTX": "使用TX地形",
  "520906ce_a5b10f12_0": "灯光建筑的使用",
  "5b0b07aa_9b5e0da7_0": "灯光建筑INI编写",
  "520b06d0_80390d19_0": "海底地图效果",
  "520906cf_3a6108d1_0": "昼夜循环",
  "5ac1077d_d6bf1953_0": "自定义遭遇战地图的预览图",
  "520b06cf_f7fd1a34_0": "战役中所属方颜色 图解说明",
  "4b4506a3_da101139_0": "常用的音效及语音（已更新）",
  "59e80739_7cd70cf5_0": "添加背景音乐",
  "5a5d076e_94851784_0": "改变任务文本信息的颜色（已更新）",
  "4b35069b_3acd1bc4_0": "触发教程1：菜鸟初学者必看！",
  "4b37069c_19451315_0": "触发教程2：局部变量",
  "4b39069d_19191363_0": "触发教程3：手动改图",
  "zzxd": "(重要)特遣脚本小队AI触发全教程",
  "520606cd_527e2227_0": "小队：让地图上现有的单位执行脚本",
  "521606d4_369d26da_0": "小队：使一个特遣部队被摧毁后触发事件",
  "5a570771_30041bf6_0": "小队：怎样做一个“轮渡”？",
  "520806ce_b488291f_0": "小队：运输船卸载后返回且成员执行命令",
  "59d30732_7db20cdb_0": "循环援军触发",
  "7ae9089f_91241e43_0": "移动到路径点脚本导致小队卡住",
  "521306d3_80321d6c_0": "关于脚本中“面向”动作的参数",
  "521806d5_250b2666_0": "触发：如何关联无限个触发到一个单位上",
  "521206d2_c18b249e_0": "触发：关于设置科技等级的触发组应用",
  "521906d6_8f942829_0": "触发：用触发或者局部变量，实现判定逻辑",
  "520c06cf_125a1385_0": "触发：炸桥触发事件",
  "521006d1_5e2e2304_0": "触发：计时器转计数器与正数计时器",
  "59d00741_d45717b2_0": "触发条件 30 电力不足 bug说明",
  "520e06d1_c3261d40_0": "触发行为 41 播放动画在... 参数说明（已更新）",
  "520106cb_d68e1a44_0": "触发行为 42 爆炸在... 参数说明（已更新）",
  "5af507a1_66511b12_0": "触发行为 88 粒子动画... 参数说明",
  "521506d4_8709261e_0": "触发行为 135 超武首选目标路径点...说明",
  "5b2707b3_f9bb1dd2_0": "触发行为 10＆100 播放影片... 参数说明",
  "520a06ce_6bac1b53_0": "触发条件 51 随机延时... 参数说明",
  "521406d3_f8421185_0": "触发类型 1 参数说明",
  "maw": "AI触发：马王神新AI教程",
  "TS平台AI(MD).ini教程（LH_Mouse原始版，Zero Fanker修订版）": "AI触发：TS平台AI(MD).ini教程（LH_Mouse原始版，Zero Fanker修订版）",
  "7d9f0912_95710c25_0": "AI触发：TS平台AI(MD).ini教程（旧版）",
  "734e083f_469b0928_0": "AI触发：地图AI教程",
  "591e0706_560d15bc_0": "给任务添加评分板评语",
  "基地节点指南": "【竹蜻蜓】基地节点指南1.1",
  "局部变量教程1.0": "【竹蜻蜓】局部变量教程1.0",
  "auygydt": "(重要)如何用记事本看地图文件(地图内部数据解析)",
  "5b0207a7_ab9c0f44_0": "红警任务变量论",
  "521106d3_4be814a4_0": "FA2工具脚本相关(待修改)",
  "5a4c077d_d0212db7_0": "【竹蜻蜓】平台差异:载具离开地图时内容物的摧毁判定",
  "5a580772_jdzxdy_0": "基地中心单元设置的初步尝试",
  "5ae30787_d7ca1103_0": "零碎内容、未添加教程（待修改）",
  "719507fb_8bc80d18_0": "任务制作细节1",
  "719b07fe_8bc90d19_0": "任务制作细节2",
  "719207f9_8bca0d1a_0": "任务制作细节3",
  "719f07ff_7e6a0cec_0": "地图制作细节",
  "719307fa_a0e20ddd_0": "NOG给资深maper的话",
  "7af60893_3e201a1_0": "Tips",
  "7ae00876_98fa17c4_0": "常见错误揭示及补救方法",
  "7b7c08ad_11a8122b_0": "单人任务制作十大BUG",
  "4b3b069e_798d0cbb_0": "无限关卡数目",
  "5a28074b_3bd71c2c_0": "制作多人联机任务必须注意的",
  "4b3f06a0_dc66114e_0": "多人合作任务教程",
  "5b3b07b7_4dc6154f_0": "关于地图内部数据解析",
  "521006d2_a65c0ec0_0": "详细的隧道教程",
  "morw": "心灵终结 自制战役注册（已更新）",
  "clb2": "ChaleB专栏文集:红色警戒2美工设计入门指引",
  "4b3b069c_e3801144_0": "修改地形，地形对象，覆盖图等（已更新）",
  "mk": "MK2019年版教程附最新版代码词典",
  "7c8a08d6_7b880ca0_0": "将代码内置进地图、部分代码示例",
  "7cf608d9_8f41172d_0": "ini宝典，内含代码与教程",
  "7d7f0915_965c1e5e_0": "改磁电弹头实现永久瘫痪等效果",
  "7d55090a_8fe91777_0": "原版废弃素材及使用办法",
  "7d2908e7_5ab40afe_0": "使用新素材",
  "72e9087c_7db60cff_0": "其他工具与教程（已更新）",
  "59ea0748_59ba0ae7_0": "了解游戏，游戏入门，快捷键大全",
  "zz": "相关组织、网站",
  "521206d0_ab190f64_0": "官方地图与任务",
  "5ab60780_ca97104c_0": "Ra2和YR单位属性大全",
  "5aea079b_7c610cd4_0": "地图加密办法",
  "7d5208eb_86210d61_0": "联机对战等",
  "5a360773_459c09a6_0": "RA3相关"
}

onMounted(() => {
  try {
    let h = window.location.hash
    if (window.location.pathname.match(/posts|about/)) return
    if (h == 'index_page') {
      window.location.hash = ''
    } else if (h) {
      isHash.value = true
      hash.value = h
      // @ts-ignore
      title.value = list[h.slice(1)]
      try {
        // @ts-ignore
        group.value = str.slice(0, str.match(h.slice(1)).index).match(/(.gif\))(.*?)(")/)[2]
        h == '#3e2c063a_37fe0885_0' ? group.value = '无分组' : 0
      } catch (e) {
        //console.warn('转换分组：', e)
        h == '#repair' ? group.value = '无分组' : 0
      }
    }
  } catch (e) {
    console.warn('转换失败：', e)
    isHash.value = true
  }
  if (location.href.match(/github\.io/)) {
    setTimeout(() => {
      let ann = document.querySelector('.gh-announcement')
      // @ts-ignore
      ann.style.display = 'unset'
    }, 1000)
  }

})
</script>

<template>
  <div class="old-widget" v-if="isHash && !isConfirm">
    <h2 class="old-title">网站升级提示</h2>
    <div class="info">您访问的是<strong>旧版页面</strong>，链接后缀为 <em>{{ hash }}</em> ，对应标题为 <strong>{{ title }}</strong> ，属于
      <strong>{{ group }}</strong> ，请从目录树寻找对应的文章
    </div>
    <button @click="confirm()">确定</button>
  </div>
</template>

<style lang="scss">
@use "sass:map";

.old-widget {
  right: 2rem;
  bottom: 2rem;
  position: fixed;
  z-index: 990;
  text-align: center;
  border-radius: 15px;
  overflow: hidden;
  box-shadow: 3px 0 10px 5px #eee;
  width: 400px;
  height: 250px;
  height: fit-content;
  box-sizing: border-box;
  padding: 1rem;
  display: flex;
  flex-direction: column;
  justify-content: space-between;
  align-items: center;
  background-color: rgba(255, 255, 255, 0.9);

  .old-title {
    font-size: 20px;
    font-weight: 900;
  }

  .info {
    line-height: 1.5;
    padding: 0.5rem 0;
  }

  button {
    border: 1px var(--va-border-color) solid;
    padding: 0 1em;
    border-radius: 8px;
  }
}

.dark .pwd-widget {
  background-color: #3333;
}

@media screen and (max-width: 768px) {
  .old-widget {
    width: min(400px, 75%);
    padding: 1em;
  }
}
</style>